{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AnimationTools",
			"Children": [
				{
					"Source":
					{
						"Text": "Add New Entry"
					},
					"Translation":
					{
						"Text": "Add New Entry"
					},
					"Key": "AddEntry"
				},
				{
					"Source":
					{
						"Text": "All Files (*.*)|*.*|CSV Files (*.csv)|*.csv"
					},
					"Translation":
					{
						"Text": "All Files (*.*)|*.*|CSV Files (*.csv)|*.csv"
					},
					"Key": "OpenDialog.FileFilter"
				},
				{
					"Source":
					{
						"Text": "Animation Splitter"
					},
					"Translation":
					{
						"Text": "Animation Splitter"
					},
					"Key": "WindowTitle"
				},
				{
					"Source":
					{
						"Text": "Animation clip name is empty"
					},
					"Translation":
					{
						"Text": "Animation clip name is empty"
					},
					"Key": "ErrorMsg.NameError"
				},
				{
					"Source":
					{
						"Text": "Are you sure to delete this entry?"
					},
					"Translation":
					{
						"Text": "Are you sure to delete this entry?"
					},
					"Key": "DeleteConfirm"
				},
				{
					"Source":
					{
						"Text": "CSV Files (*.csv)|*.csv"
					},
					"Translation":
					{
						"Text": "CSV Files (*.csv)|*.csv"
					},
					"Key": "SaveDialog.FileFilter"
				},
				{
					"Source":
					{
						"Text": "Can`t open CSV file:{0}"
					},
					"Translation":
					{
						"Text": "Can`t open CSV file:{0}"
					},
					"Key": "ErrorMsg.CSVOpenFailed"
				},
				{
					"Source":
					{
						"Text": "Can`t save CSV file:{0}"
					},
					"Translation":
					{
						"Text": "Can`t save CSV file:{0}"
					},
					"Key": "ErrorMsg.CSVSaveFailed"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "Close"
					},
					"Key": "CloseButton"
				},
				{
					"Source":
					{
						"Text": "Close this window"
					},
					"Translation":
					{
						"Text": "Close this window"
					},
					"Key": "CloseTooltip"
				},
				{
					"Source":
					{
						"Text": "Delete this entry"
					},
					"Translation":
					{
						"Text": "Delete this entry"
					},
					"Key": "DeleteEntryTooltip"
				},
				{
					"Source":
					{
						"Text": "End Frame"
					},
					"Translation":
					{
						"Text": "End Frame"
					},
					"Key": "EntryEndFrame"
				},
				{
					"Source":
					{
						"Text": "Export to CSV"
					},
					"Translation":
					{
						"Text": "Export to CSV"
					},
					"Key": "SaveCSVButton"
				},
				{
					"Source":
					{
						"Text": "Import from CSV"
					},
					"Translation":
					{
						"Text": "Import from CSV"
					},
					"Key": "OpenCSVButton"
				},
				{
					"Source":
					{
						"Text": "Invalid CSV format"
					},
					"Translation":
					{
						"Text": "Invalid CSV format"
					},
					"Key": "ErrorMsg.CSVFormatError"
				},
				{
					"Source":
					{
						"Text": "Invalid end frame"
					},
					"Translation":
					{
						"Text": "Invalid end frame"
					},
					"Key": "ErrorMsg.FrameError2"
				},
				{
					"Source":
					{
						"Text": "Invalid start frame"
					},
					"Translation":
					{
						"Text": "Invalid start frame"
					},
					"Key": "ErrorMsg.FrameError1"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": "Name"
					},
					"Key": "EntryName"
				},
				{
					"Source":
					{
						"Text": "No selected Animation"
					},
					"Translation":
					{
						"Text": "No selected Animation"
					},
					"Key": "ErrorMsg.AnimError"
				},
				{
					"Source":
					{
						"Text": "Open File"
					},
					"Translation":
					{
						"Text": "Open File"
					},
					"Key": "OpenDialog.Title"
				},
				{
					"Source":
					{
						"Text": "Save File"
					},
					"Translation":
					{
						"Text": "Save File"
					},
					"Key": "SaveDialog.Title"
				},
				{
					"Source":
					{
						"Text": "Save to directory:"
					},
					"Translation":
					{
						"Text": "Save to directory:"
					},
					"Key": "SaveToDir"
				},
				{
					"Source":
					{
						"Text": "Split Animation"
					},
					"Translation":
					{
						"Text": "Split Animation"
					},
					"Key": "split_anim"
				},
				{
					"Source":
					{
						"Text": "Split Animations"
					},
					"Translation":
					{
						"Text": "Split Animations"
					},
					"Key": "SplitButton"
				},
				{
					"Source":
					{
						"Text": "Split the selected animation into segments."
					},
					"Translation":
					{
						"Text": "Split the selected animation into segments."
					},
					"Key": "split_anim_desc"
				},
				{
					"Source":
					{
						"Text": "Start Frame"
					},
					"Translation":
					{
						"Text": "Start Frame"
					},
					"Key": "EntryStartFrame"
				},
				{
					"Source":
					{
						"Text": "Succeed export to:{0}"
					},
					"Translation":
					{
						"Text": "Succeed export to:{0}"
					},
					"Key": "ErrorMsg.CSVSaveSucceed"
				},
				{
					"Source":
					{
						"Text": "The end frame must be greater than or equal to the start frame"
					},
					"Translation":
					{
						"Text": "The end frame must be greater than or equal to the start frame"
					},
					"Key": "ErrorMsg.FrameError3"
				}
			]
		}
	]
}